//1.დაწერეთ პროგრამა რომელიც მომხმარებელს მოთხოვს შეიყვანოს მისი ასაკი წლებში და სანაცვლოდ გამოითვლის მის ასაკს დღეებში. (დააიგნორეთ ნაკიანი წლები)
let user = prompt("შეიყვანეთ თქვენი ასაკი (წლებში).");
let livingDays = user*365;
console.log(`თქვენ ხართ ${livingDays} დღის.`);
alert(`თქვენ ხართ ${livingDays} დღის.`);

/*
2.	დაწერეთ პროგრამა, რომელიც 3 ინფუთის მიწოდებისას, მოახდენს მათზე კალკულაციას და დაგვიბრუნებს შედეგს შემდეგი სახით:
calc(2, 2, "+") ➞ 4
// 2 + 2 = 4

operate(12, 4, "%") ➞ 0
// 12 % 4 = 0
*/
let userNum1 = prompt("შეიყვანეთ 1-ლი ციფრი.");
let userNum2 = prompt("შეიყვანეთ მე-2 ციფრი.");
let operate = prompt("შეიყვანეთ ოპერაციის ტიპი (+, -, *, /, ^ ან %).");
let response = 0
switch(operate){
    case '+':
        response = Number(userNum1) + Number(userNum2);
    break;
    case '-':
        response = Number(userNum1) - Number(userNum2);
    break;
    case '*':
        response = Number(userNum1) * Number(userNum2);
    break;
    case '/':
        response = Number(userNum1) / Number(userNum2);
    break;
    case '^':
        response = Math.pow(Number(userNum1), Number(userNum2));
    break;
    case '%':
        response = Number(userNum1) % Number(userNum2);
    break;
};
console.log(`გამოთვლის შედეგია ${response}`);
alert(`გამოთვლის შედეგია ${response}`);

//3.მოთხოვეთ მომხმარებელს შეიყვანოს სტრინგი და გამოთვალეთ ეს სტრინგი ლუწია თუ კენტი. (მინიშნება .length)
let users = prompt("შეიყვანეთ ტექსტი და გაიგეთ მისი ასოთა რაოდენობა ლუწია თუ კენტია.");
if(users.length %2 ==0){
    console.log(`თქვენს მიერ შეყვანილი ტექსტის ასოთა რაოდენობა ლუწი რიცვია`);
    alert(`თქვენს მიერ შეყვანილი ტექსტის ასოთა რაოდენობა ლუწი რიცვია`);
} else if(users.length %2 ==1){
    console.log(`თქვენს მიერ შეყვანილი ტექსტის ასოთა რაოდენობა კენტი რიცვია`);
    alert(`თქვენს მიერ შეყვანილი ტექსტის ასოთა რაოდენობა კენტი რიცვია`);
} else {
    console.log(`შეიყვანეთ ტექსტი!`);
    alert(`შეიყვანეთ ტექსტი!`);
}

//4.დაწერეთ ფუნქცია, რომელიც მოთხოვს მომხმარებელს შეიყვანოს რაიმე x რიცხვი და გამოთვლის მე-x-ე ლუწ რიცხვს. (მაგ. 6-ზე გამოთვლის მე-6 ლუწ რიცხვს 0-დან)
let num = prompt("შეიყვანეთ რიცხვი.");
const luwiShedegi = function(){
    return num*2;
};
console.log(`რიგით ${num} ლუწი რიცხვია: ${luwiShedegi()}.`);
alert(`რიგით ${num} ლუწი რიცხვია: ${luwiShedegi()}.`);

//5.დაწერეთ ფუნქცია, რომელიც მოთხოვს მომხმარებელს შეიყვანოს რაიმე საათი და გადააკონვერტირებს ამ რიცხვს წამებში
let hour = prompt("შეიყვანეთ საათი.");
const seconds = () => {
    return hour*3600;
};
console.log(`${hour} საათი ${seconds()} წამია.`);
alert(`${hour} საათი ${seconds()} წამია.`);

/*
6.	რუბიკ კუბიკს გააჩნია 6 გვერდი, თითო გვერდზე განთავსებულია კვადრატული სტიკერები იმდენ მწკივში, რამდენსაც მიუთითებს მომხმარებელი. თუ კუბიკს გააჩნია 2 მწკრივი ერთ გვერდზე, შესაბამისად ერთი მწკრივი დაიტევს 2 კვადრატს და ერთ გვერდზე სულ გვექნება 4 კვადრატი. 3 მწკრივზე - 9, 1 მწკრივზე კი 1. დაწერეთ პროგრამა რომელიც მომხმარებელს სთხოვს შეიყვანოს 1, 2 ან 3 და შესაბამისად დაითვლის კვადრატების საერთო ჯამს კუბიკის ყველა გვერდზე.
*/
let mckrivi = prompt("შეიყვანეთ კუბის გვერდით შესაძლო მწკრივთა რაოდენობა(მაგ. 3)");
const kvadrati = () =>{
    return Math.pow(mckrivi, 2)*6;
};
console.log(`კუბის გარშემო არსებული კვადრატების საერთო რაოდენობაა: ${kvadrati()}`);
alert(`კუბის გარშემო არსებული კვადრატების საერთო რაოდენობაა: ${kvadrati()}`);